# 00. 文字列の逆順
# 文字列"stressed"の文字を逆に（末尾から先頭に向かって）並べた文字列を得よ．

##https://note.nkmk.me/python-reverse-reversed/
##イテレータはリストなどの配列があるものしか聞かない(文字列の順序を気にしない)
##ので、文字列をリスト化してからイテレータを効かせるreversedを使用する
##文字列そのままやタプルはイミュータブル(更新不可)なので、元のオブジェクトを書き換えるreverse()メソッドは用意されていない

print(''.join(list(reversed('stressed'))))

##https://note.nkmk.me/python-slice-usage/
##上記のやり方はめんどくさいのでスライサーで解決する。
##スライサーは文字列に関しても一文字ずつ認識するので使える

'stressed'[::-1]

##リストの文字列に対してもやってみる
##リストの中の順番も、文字列の順番も反対にしたい
x1 = ['abc','012','ABC']

##mapを使うことで解決
##内包表記との使い分けってどうしてるんだろ。。。
list(map(lambda i2:i2[::-1],[i1 for i1 in x1[::-1]]))
